CEFSA - Centro Educacional da Fundação Salvador Arena |
FESA - Faculdade Engenheiro Salvador Arena | 
São Bernardo do Campo, 08 de março de 2025 | 
Heitor Santos Ferreira - RA: 081230042 - Engenharia de Computação - 6° Semestre - EC6 | 
Eletiva II - Ambientes Inteligentes | 
Professor Elias Kento Tomiyama

# TABELA DE 'RATINGS'

### Importanto biliotecas

In [1]:
import pandas as pd

### Importando tabela

In [3]:
df_ratings = pd.read_csv(r'C:\Users\Heitor\OneDrive - Fundação Salvador Arena\6 - Sexto Semestre\Ambientes Inteligentes\grouplens-datasets-analysis\data\ratings.csv')

In [5]:
df_ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

### Realizando correções

In [10]:
#Alterando nomes das colunas para melhor compreensão
df_ratings.rename(columns={'userId': 'ID usuario', 'movieId': 'ID filme', 'rating': 'Nota', 'timestamp': 'Data e hora da avalicao'}, inplace=True)

In [7]:
df_ratings.head()

   ID usuario  ID filme  Nota  Data e hora da avalicao
0           1         1   4.0                964982703
1           1         3   4.0                964981247
2           1         6   4.0                964982224
3           1        47   5.0                964983815
4           1        50   5.0                964982931

In [ ]:
#Convertendo valores 'timestamp' para data e horas reais
df_ratings['Data e hora da avalicao'] = pd.to_datetime(df_ratings['Data e hora da avalicao'], unit='s')

In [9]:
df_ratings.head()

   ID usuario  ID filme  Nota Data e hora da avalicao
0           1         1   4.0     2000-07-30 18:45:03
1           1         3   4.0     2000-07-30 18:20:47
2           1         6   4.0     2000-07-30 18:37:04
3           1        47   5.0     2000-07-30 19:03:35
4           1        50   5.0     2000-07-30 18:48:51

### Exibindo informações gerais sobre a tabela e realizando sua apresentação final

In [11]:
print(f'O dataset possui {df_ratings.shape[0]} exemplos/amostras/linhas e {df_ratings.shape[1]} atributos/variáveis/colunas.')

O dataset possui 100836 exemplos/amostras/linhas e 4 atributos/variáveis/colunas.

In [12]:
df_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   ID usuario               100836 non-null  int64
 1   ID filme                 100836 non-null  int64
 2   Nota                     100836 non-null  float64
 3   Data e hora da avalicao  100836 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2)
memory usage: 3.1 MB

In [13]:
df_ratings.describe()

,ID usuario,ID filme,Nota,Data e hora da avalicao
count,100836.000000,100836.000000,100836.000000,100836
mean,326.127564,19435.295718,3.501557,2008-03-19 17:01:27.368469248
min,1.000000,1.000000,0.500000,1996-03-29 18:36:55
25%,177.000000,1199.000000,3.000000,2002-04-18 09:57:46
50%,325.000000,2991.000000,3.500000,2007-08-02 20:31:02
75%,477.000000,8122.000000,4.000000,2015-07-04 07:15:44.500000
max,610.000000,193609.000000,5.000000,2018-09-24 14:27:30
std,182.618491,35530.987199,1.042529,NaN